{
    "abilities": [
        {"name": "Strength","abilityImprovements": 0,"baseScore": 12,"miscBonus": 0},
        {"name": "Dexterity","abilityImprovements": 0,"baseScore": 15,"miscBonus": 0},
        {"name": "Constitution","abilityImprovements": 0,"baseScore": 13,"miscBonus": 0},
        {"name": "Intelligence","abilityImprovements": 0,"baseScore": 10,"miscBonus": 0},
        {"name": "Wisdom","abilityImprovements": 0,"baseScore": 14,"miscBonus": 0},
        {"name": "Charisma","abilityImprovements": 0,"baseScore": 8,"miscBonus": 0}
    ],
    "actions": [],
    "alignment": "Neutral Good",
    "bonusActions": [
        {
            "name": "Flurry of Blows",
            "description": "After you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action."
        },
        {
            "name": "Patient Defense",
            "description": "You can spend 1 ki point to take the Dodge action as a bonus action on your turn."
        },
        {
            "name": "Step of the Wind",
            "description": "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
        },
        {
            "name": "Unarmed Strike",
            "description": "When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action."
        }
    ],
    "class": {
        "name": "Monk",
        "subclass": {
            "name": "Open Hand"
        }
    },
    "immunities": [],
    "inventory": {
        "backpack": ["Potion of Healing (2)","Bedroll","Mess Kit","Rations (10 days)","Rope, Hempen (50 feet)","Tinderbox","Torch","Waterskin"],
        "equipped": ["Quarterstaff","Dart"],
        "gold": 400
    },
    "languages": ["Halfling", "Infernal"],
    "level": 3,
    "name": "Zareth Stonestride",
    "proficiencies": [],
    "race": {
        "name": "Half-Orc"
    },
    "reactions": [
        {
            "name": "Deflect Missiles",
            "description": "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.<br/>If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack, which has a normal range of 20 feet and a long range of 60 feet."
        }
    ],
    "resistances": [],
    "senses": [],
    "specialActions": [
        {
            "name": "Ki Points",
            "description": "You can spend Ki Points to fuel ki features. You have 3 points per short rest and your Ki save DC is 12."
        },
        {
            "name": "Martial Arts",
            "description": "While you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield, you can use DEX instead of STR for the attack and damage rolls, you can roll your Martial Arts damage die in place of the normal damage, and when you use the Attack action on your turn, you can make one unarmed strike as a bonus action."
        },
        {
            "name": "Open Hand Technique",
            "description": "Whenever you hit with one of your Flurry of Blows attacks, you can impose one of the following effects on that target: fall prone if it fails a DEX saving throw (DC 12), get pushed up to 15 ft. if it fails a STR saving throw (DC 12), or it can't take reaction until the end of your next turn."
        },
        {
            "name": "Relentless Endurance",
            "description": "When you are reduced to 0 HP but not killed, you can drop to 1 HP instead once per long rest."
        },
        {
            "name": "Savage Attacks",
            "description": "When you score a critical hit, roll one of the weapon's dice one additional time and add it to the extra damage."
        }
    ],
    "skillProficiencies": ["Acrobatics","Insight","Intimidation","Medicine","Religion"],
    "spells": [],
    "vulnerabilities": []
}